//--------------------------------------------------------------------------//
// xmtnimage18.cc                                                           //
// Reading & writing of bmp files                                           //
// Latest revision: 04-17-2002                                              //
// Copyright (C) 2002 by Thomas J. Nelson                                   //
// See xmtnimage.h for Copyright Notice                                     //
// Adapted from "bmp_code.txt" by James D. Murray, Anaheim, CA, USA         //
//--------------------------------------------------------------------------//

#include "xmtnimage.h"

extern Globals     g;
extern Image      *z;
extern int         ci;


//----bmp.h-----------------------------------------------------------------//

#define COMPRESS_RGB        0L      // No compression                 
#define COMPRESS_RLE8       1L      // 8 bits per pixel compression   
#define COMPRESS_RLE4       2L      // 4 bits per pixel compression   
#define BMP_ID              0x4d42  // BMP "magic" number             

#define LSN(value)        ((value) & 0x0f)            // Least-significant nibble   
#define MSN(value)        (((value) & 0xf0) >> 4)        // Most-significant nibble    

//  BMP File Format Bitmap Header
  
typedef struct BmpInfo      // Offset   Description                        
{   ushort   Type;          //  00h     File Type Identifier               
    uint  FileSize;         //  02h     Size of File                       
    ushort   Reserved1;     //  06h     Reserved (should be 0)             
    ushort   Reserved2;     //  08h     Reserved (should be 0)             
    uint  Offset;           //  0Ah     Offset to bitmap data              
} BMPINFO;

//  Presentation Manager (OS/2 1.x) Information Header Format.
  
typedef struct PmInfoHeader    // Offset   Description                       
{   uint   Size;               //  0Eh     Size of Remianing Header          
    ushort    Width;           //  12h     Width of Bitmap in Pixels         
    ushort    Height;          //  14h     Height of Bitmap in Pixels        
    ushort    Planes;          //  16h     Number of Planes                  
    ushort    BitCount;        //  18h     Color Bits Per Pixel              
} PMINFOHEAD;

//  Windows 3.x Information Header Format.
  
typedef struct WinInfoHeader   // Offset  Description                        
{   uint  Size;                //  0Eh    Size of Remianing Header           
    uint  Width;               //  12h    Width of Bitmap in Pixels          
    uint  Height;              //  16h    Height of Bitmap in Pixels         
    ushort   Planes;           //  1Ah    Number of Planes                   
    ushort   BitCount;         //  1Ch    Bits Per Pixel                     
    uint  Compression;         //  1Eh    Compression Scheme (0=none)        
    uint  SizeImage;           //  22h    Size of bitmap in bytes            
    uint  XPelsPerMeter;       //  26h    Horz. Resolution in Pixels/Meter   
    uint  YPelsPerMeter;       //  2Ah    Vert. Resolution in Pixels/Meter   
    uint  ClrUsed;             //  2Eh    Number of Colors in Color Table    
    uint  ClrImportant;        //  32h    Number of Important Colors         
} WININFOHEAD;


//  Presentation Manager (OS/2 2.0) Information Header Format.
  
typedef struct Pm2InfoHeader   // Offset  Description                        
{  
    uint   Size;               //  0Eh    Size of Info Header (always 64)    
    ushort Width;              //  12h    Width of Bitmap in Pixels          
    ushort Height;             //  14h    Height of Bitmap in Pixels         
    ushort Planes;             //  16h    Number of Planes                   
    ushort BitCount;           //  18h    Color Bits Per Pixel               
    uint   Compression;        //  1Ah    Compression Scheme (0=none)        
    uint   SizeImage;          //  1Eh    Size of bitmap in bytes            
    uint   XPelsPerMeter;      //  22h    Horz. Resolution in Pixels/Meter   
    uint   YPelsPerMeter;      //  26h    Vert. Resolution in Pixels/Meter   
    uint   ClrUsed;            //  2Ah    Number of Colors in Color Table    
    uint   ClrImportant;       //  2Eh    Number of Important Colors         
    ushort Units;              //  32h    Resolution Mesaurement Used        
    ushort Reserved;           //  34h    Reserved FIelds (always 0)         
    ushort Recording;          //  36h    Orientation of Bitmap              
    ushort Rendering;          //  38h    Halftone Algorithm Used on Image   
    uint   Size1;              //  3Ah    Halftone Algorithm Data            
    uint   Size2;              //  3Eh    Halftone Algorithm Data            
    uint   ColorEncoding;      //  42h    Color Table Format (always 0)      
    uint   Identifier;         //  46h    Misc. Field for Application Use    
} PM2INFOHEAD;

//  Presentation Manager (OS/2) RGB Color Triple.
  
typedef struct PmRgbTriple
{   uchar   rgbBlue;             // Blue Intensity Value    
    uchar   rgbGreen;            // Green Intensity Value   
    uchar   rgbRed;              // Red Intensity Value     
} PMRGBTRIPLE;

//  Windows 3.x RGB Color Quadruple.
  
typedef struct WinRgbQuad
{   uchar   rgbBlue;             // Blue Intensity Value     
    uchar   rgbGreen;            // Green Intensity Value    
    uchar   rgbRed;              // Red Intensity Value      
    uchar   rgbReserved;         // Reserved (should be 0)   
} WINRGBQUAD;

//  OS/2 2.0 RGB Color Quadruple.
  
typedef struct Pm2RgbQuad
{
    uchar   rgbBlue;             // Blue Intensity Value     
    uchar   rgbGreen;            // Green Intensity Value    
    uchar   rgbRed;              // Red Intensity Value      
